Basic stats not plotted here, but they are on the R notebook.

In [1]:
import pandas as pd
import numpy as np

titanic_file_path = '../data/titanic/train.csv'
titanic_data = pd.read_csv(titanic_file_path) 
titanic_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [2]:
def age_to_str(v):
    if ~np.isnan(v.Age):
        return str(round(v.Age/10))+'0'
    else:
        return 'NaN'

In [3]:
titanic_data['AgeClass'] = titanic_data.apply(lambda v: age_to_str(v), axis=1)

In [4]:
titanic_data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
AgeClass        object
dtype: object

In [5]:
titanic_data.sample(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,AgeClass
402,403,0,3,"Jussila, Miss. Mari Aina",female,21.0,1,0,4137,9.8250,NaN,S,20
183,184,1,2,"Becker, Master. Richard F",male,1.0,2,1,230136,39.0000,F4,S,00
683,684,0,3,"Goodwin, Mr. Charles Edward",male,14.0,5,2,CA 2144,46.9000,NaN,S,10
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,55.0,0,0,248706,16.0000,NaN,S,60
509,510,1,3,"Lang, Mr. Fang",male,26.0,0,0,1601,56.4958,NaN,S,30
650,651,0,3,"Mitkoff, Mr. Mito",male,NaN,0,0,349221,7.8958,NaN,S,NaN
581,582,1,1,"Thayer, Mrs. John Borland (Marian Longstreth M...",female,39.0,1,1,17421,110.8833,C68,C,40
813,814,0,3,"Andersson, Miss. Ebba Iris Alfrida",female,6.0,4,2,347082,31.2750,NaN,S,10
616,617,0,3,"Danbom, Mr. Ernst Gilbert",male,34.0,1,1,347080,14.4000,NaN,S,30
579,580,1,3,"Jussila, Mr. Eiriik",male,32.0,0,0,STON/O 2. 3101286,7.9250,NaN,S,30

In [6]:
y = titanic_data.Survived

In [7]:
# Important variables
# (Survived)
# Pclass (Ticket class)
# Sex
# Age

In [8]:
survived_data = titanic_data[titanic_data['Survived']==True]
survived_data.shape

(342, 13)

In [9]:
perished_data = titanic_data[titanic_data['Survived']==False]
perished_data.shape

(549, 13)

In [24]:
s = survived_data.groupby(['AgeClass','Pclass','Sex']).count()['Survived'].reset_index()
s.head()

  AgeClass  Pclass     Sex  Survived
0       00       1    male         2
1       00       2  female         5
2       00       2    male         8
3       00       3  female        11
4       00       3    male         5

In [26]:
p = perished_data.groupby(['AgeClass','Pclass','Sex']).count()['Survived'].reset_index()
p.head()

  AgeClass  Pclass     Sex  Survived
0       00       1  female         1
1       00       3  female         4
2       00       3    male         8
3       10       3  female        10
4       10       3    male        10